# Upgrade core utilities
brew "coreutils"
brew "git"
brew "wget"
brew "curl"
brew "openssl"
brew "bash"
brew "perl"
brew "python"
brew "python3"
brew "ruby"

# CLI tools
brew "zsh"
cask "oh-my-zsh"
brew "zsh-completions"
brew "lynx"
brew "neovim"
brew "tmux"
brew "the_silver_searcher"
brew "awscli"
brew "entr"
brew "mas"

# Apps
cask "google-chrome"
cask "firefox-developer-edition"
cask "dropbox"
cask "karabiner-elements"
cask "spotify"
cask "postman"
cask "iterm2"
cask "docker"
cask "visual-studio"
cask "slack"

# Languages
brew "nvm"
brew "ocaml"
brew "opam"
cask "java"
brew "scala"
brew "dotnet"

# Etc.
cask "font-fira-code"
