tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# upgrade core utils
brew "openssl"
brew "coreutils"
brew "curl"
brew "perl"
brew "python@3.8"
brew "git"
brew "wget"
brew "zsh"

# cli tools
brew "fzf"
brew "getmail"
brew "jq"
brew "mas"
brew "pandoc"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tmux"
brew "vim"
cask "mactex"

# languages
brew "node"
brew "nvm"
brew "yarn"

# apps
cask "amethyst"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "iterm2"
cask "postman"
cask "spotify"
mas "Affinity Photo", id: 824183456
cask "rectangle"
cask "microsoft-edge"
